let score = 0

let answer1 = prompt("Вопрос 1: Сколько будет 2 + 2?")
if (answer1 === "4") {
    score += 10
}
// Мне сложно сделать правильный ответ чтобы он начинался с верхнего регистра (Париж), поэтому будет пока с нижнего,
// просто я загуглил toUpperCase, а он делает всю строку заглавными буквами
let answer2 = prompt("Вопрос 2: Столица Франции?")
if (answer2.toLowerCase() === "париж") {
    score += 10
}

let answer3 = confirm("Вопрос 3: Земля круглая?")
if (answer3 === true) {
    score += 10
}

let answer4 = prompt("Вопрос 4: Какой правильный ответ на главный вопрос жизни, вселенной и всего такого?")
if (answer4 === "42") {
    score += 10
}

if (score === 40) {
    alert("Поздравляем! Вы набрали максимальное количество очков: " + score)
} else {
    alert("Ваш результат: " + score + " очков")
}